import React from "react";
import './desc.scss';
import 'bootstrap/dist/css/bootstrap.min.css';

const Description = () => {
  return (
    <div className="description">
      <div className="section">
        <p><b>Добровершники, до справ! 🌟</b></p>
        <p>Напередодні свят кожна дитина мріє про казку. Але є малята, поруч із якими немає рідних. Вони так чекають тепла і віри у чудеса.</p>
        <p>Цього року ми разом створимо магію для дітей з дитячих будинків у Черкасах, Вінниці, Кам'янець-Подільському, Сквирі та Хмільниці. Тут живуть чи навчаються малята, які втратили дім, але не віру в добро.</p>
        <p>Давайте разом станемо Святими Миколаями! Виберіть листа-побажання від малюка і подаруйте йому радість. Ми передамо ваші подарунки і поділимось фото цієї казки.</p>
        <p>Даруймо разом радість та віру в чудеса!</p>
      </div>
    </div>
  );
};

export default Description;
