import React from "react";
import './desc.scss';
import 'bootstrap/dist/css/bootstrap.min.css';

const Description = () => {
  return (
    <div className="description">
      <div className="section">
        <p><b>Добровершники, до справ! 🌟</b></p>
        <p>Напередодні свят кожна дитинка мріє про казку. Але є малята, поруч із якими немає рідних. Вони так чекають тепла та справжнього зимового дива.</p>
        <p>Цього року ми разом створимо магію для вихованців дитячих будинків у Черкасах, Вінниці, Кам'янець-Подільському, Сквирі та Хмільниці. Тут живуть чи навчаються малята, які мимохіть потрапили у складні життєві обставини, але не втратили віру в добро.</p>
        <p>Давайте разом станемо для них тими самими Миколайчиками, які робили нас щасливими у дитинстві! Виберіть свого мрійника і подаруйте йому радість, адже ви це вмієте якнайкраще ❤️. А ми передамо ваші подарунки і поділимося з вами світлинами цієї історії з гарним кінцем.</p>
        <p>Даруймо разом радість та віру в дива!</p>
      </div>
    </div>
  );
};

export default Description;
